experiments/01_simple_laminar_10mm/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Blood rheology (Newtonian approximation for large vessels, Re << 2300)
//   Dynamic viscosity : mu  = 0.0035  Pa·s
//   Density           : rho = 1060    kg/m³
//   Kinematic viscosity: nu = mu/rho = 3.3018e-6 m²/s ≈ 3.3e-6 m²/s

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 3.3e-06;

// ************************************************************************* //
